[
  {
    "id": "clsu-cat",
    "title": "CLSU College Admission Test Online Application System",
    "date": "2021",
    "role": "Full-Stack Developer",
    "image": "clsucat mockup.png",
    "description": "A web-based application system that enables prospective students to apply for the CLSU College Admission Test by submitting personal information, academic details, and required documents online. The system streamlines the application process, improves data accuracy, and supports efficient admission screening.",
    "contributions": [
      "Designed and developed the entire system using PHP, JavaScript, MySQL, and REST API.",
      "Built an end-to-end online application workflow, replacing manual, paper-based submissions.",
      "Integrated Gemini API for AI-powered photo verification to ensure applicants met strict ID photo requirements.",
      "Optimized user experience for accessibility, reducing manual workload and eliminating long queues."
    ],
    "tech": [
      { "name": "PHP" },
      { "name": "JavaScript" },
      { "name": "MySQL" },
      { "name": "REST API" },
      { "name": "Gemini API" }
    ],
    "impact": "Increased the number of applicants each year, breaking all-time student application records."
  },
  {
    "id": "clsu-tfs",
    "title": "CLSU Thesis/Dissertation Formatting Systems",
    "date": "2023",
    "role": "Full-Stack Developer",
    "image": "tfs mockup.png",
    "description": "A document processing tool that automatically applied official university formatting guidelines to academic manuscripts.",
    "contributions": [
      "Built a formatting system with Laravel, PHP, JavaScript, MySQL, and REST API.",
      "Enabled students to create manuscripts and instantly generate format-compliant versions, removing dependency on third-party formatting services.",
      "Reduced faculty review time by ensuring submissions adhered to official formatting requirements."
    ],
    "tech": [
      { "name": "PHP" },
      { "name": "Laravel" },
      { "name": "JavaScript" },
      { "name": "MySQL" },
      { "name": "REST API" }
    ],
    "impact": "Eliminated the need for students to pay third-party services for thesis formatting."
  },
  {
    "id": "clsu-pfe",
    "title": "CLSU Faculty Performance Evaluation System",
    "date": "2025",
    "role": "Full-Stack Developer",
    "image": "evaluation mockup.png",
    "description": "A web-based system designed to automate faculty performance evaluation by recording and managing evaluation data. The system improves efficiency, ensures data consistency, and supports academic decision-making.",
    "contributions": [
      "Rebuilt and maintained the evaluation platform using Laravel, PHP, JavaScript, MySQL, and REST API.",
      "Designed and implemented a normalized database schema for scalability and improved performance.",
      "Delivered real-time evaluation reports, reducing manual work for administrators and improving decision-making.",
      "(Legacy System Contribution) Integrated Gemini API to summarize faculty evaluation feedback, enhancing report readability."
    ],
    "tech": [
      { "name": "PHP" },
      { "name": "Laravel" },
      { "name": "JavaScript" },
      { "name": "MySQL" },
      { "name": "REST API" }
    ],
    "impact": "Streamlined evaluation workflow and improved accessibility of faculty evaluation data."
  }
]
